# Short Introduction to Pandas

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

## Object Creation

In [3]:
#Series

s = pd.Series([1, 3, 5, np.nan, 6, 8])
print(s)

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
# DataFrame

dates = pd.date_range("20130101", periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01  2.191036  1.442880  1.858224 -0.398214
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826
2013-01-03  1.127938 -0.936733  0.489521  0.409856
2013-01-04 -1.117534  0.230341  2.110083  0.290532
2013-01-05  0.525189  0.648209  0.299254 -0.902637
2013-01-06 -1.096093 -0.014718 -1.093987 -0.396213

In [6]:
# Dict of objects

df2 = pd.DataFrame({"A": 1, 
                    "B": pd.Timestamp("20130102"), 
                    "C": pd.Series(1, index = list(range(4)), dtype = "float"), 
                    "D": np.array([3] * 4, dtype = "int32"), 
                    "E": pd.Categorical(["test", "train", "test", "train"]), 
                    "F": "foo"})
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [7]:
# dtypes
df2.dtypes

A             int64
B    datetime64[ns]
C           float64
D             int32
E          category
F            object
dtype: object

In [8]:
# View first five rows

df.head()

                   A         B         C         D
2013-01-01  2.191036  1.442880  1.858224 -0.398214
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826
2013-01-03  1.127938 -0.936733  0.489521  0.409856
2013-01-04 -1.117534  0.230341  2.110083  0.290532
2013-01-05  0.525189  0.648209  0.299254 -0.902637

In [9]:
# View last three rows

df.tail(3)

                   A         B         C         D
2013-01-04 -1.117534  0.230341  2.110083  0.290532
2013-01-05  0.525189  0.648209  0.299254 -0.902637
2013-01-06 -1.096093 -0.014718 -1.093987 -0.396213

In [10]:
# View index of DataFrame

df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
# View columns of DataFrame

df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
# View values of DataFrame

df.values

array([[ 2.19103604,  1.44287985,  1.85822391, -0.39821405],
       [-0.23359193,  1.44031427, -1.32316127, -0.86382586],
       [ 1.12793837, -0.93673331,  0.48952068,  0.4098558 ],
       [-1.11753449,  0.23034073,  2.11008328,  0.29053171],
       [ 0.52518873,  0.64820881,  0.29925444, -0.90263729],
       [-1.09609262, -0.01471809, -1.09398692, -0.3962134 ]])

In [13]:
# Statistics Summary

df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.232824  0.468382  0.389989 -0.310084
std    1.306012  0.915536  1.433154  0.557133
min   -1.117534 -0.936733 -1.323161 -0.902637
25%   -0.880467  0.046547 -0.745677 -0.747423
50%    0.145798  0.439275  0.394388 -0.397214
75%    0.977251  1.242288  1.516048  0.118845
max    2.191036  1.442880  2.110083  0.409856

In [14]:
# Transposing the data

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.191036   -0.233592    1.127938   -1.117534    0.525189   -1.096093
B    1.442880    1.440314   -0.936733    0.230341    0.648209   -0.014718
C    1.858224   -1.323161    0.489521    2.110083    0.299254   -1.093987
D   -0.398214   -0.863826    0.409856    0.290532   -0.902637   -0.396213

In [15]:
# Sorting by an axis

df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -0.398214  1.858224  1.442880  2.191036
2013-01-02 -0.863826 -1.323161  1.440314 -0.233592
2013-01-03  0.409856  0.489521 -0.936733  1.127938
2013-01-04  0.290532  2.110083  0.230341 -1.117534
2013-01-05 -0.902637  0.299254  0.648209  0.525189
2013-01-06 -0.396213 -1.093987 -0.014718 -1.096093

In [16]:
# Sort by Values

df.sort_values(by = "B")

                   A         B         C         D
2013-01-03  1.127938 -0.936733  0.489521  0.409856
2013-01-06 -1.096093 -0.014718 -1.093987 -0.396213
2013-01-04 -1.117534  0.230341  2.110083  0.290532
2013-01-05  0.525189  0.648209  0.299254 -0.902637
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826
2013-01-01  2.191036  1.442880  1.858224 -0.398214

## Selection by Column

In [17]:
# Select data of A

df["A"]

2013-01-01    2.191036
2013-01-02   -0.233592
2013-01-03    1.127938
2013-01-04   -1.117534
2013-01-05    0.525189
2013-01-06   -1.096093
Freq: D, Name: A, dtype: float64

In [18]:
# Slices the rows

df[0:3]

                   A         B         C         D
2013-01-01  2.191036  1.442880  1.858224 -0.398214
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826
2013-01-03  1.127938 -0.936733  0.489521  0.409856

In [19]:
# Slices the rows

df["20130102": "20130104"]

                   A         B         C         D
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826
2013-01-03  1.127938 -0.936733  0.489521  0.409856
2013-01-04 -1.117534  0.230341  2.110083  0.290532

In [20]:
# Cross Section

df.loc[dates[0]]

A    2.191036
B    1.442880
C    1.858224
D   -0.398214
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
# multi-axis by label

df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  2.191036  1.442880
2013-01-02 -0.233592  1.440314
2013-01-03  1.127938 -0.936733
2013-01-04 -1.117534  0.230341
2013-01-05  0.525189  0.648209
2013-01-06 -1.096093 -0.014718

In [22]:
# Both endpoints included

df.loc[dates[1:4], ["A", "B"]]

                   A         B
2013-01-02 -0.233592  1.440314
2013-01-03  1.127938 -0.936733
2013-01-04 -1.117534  0.230341

In [23]:
# Reduction in dimension

df.loc["20130102", ["A", "B"]]

A   -0.233592
B    1.440314
Name: 2013-01-02 00:00:00, dtype: float64

In [24]:
# Scalar Value

df.loc[dates[1], "C"]

-1.3231612738379945

## Selection by Rows

In [25]:
# Row 4 data

df.iloc[3]

A   -1.117534
B    0.230341
C    2.110083
D    0.290532
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
# integer slicing

df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.117534  0.230341
2013-01-05  0.525189  0.648209

In [27]:
# integer position

df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -0.233592 -1.323161
2013-01-03  1.127938  0.489521
2013-01-05  0.525189  0.299254

In [28]:
# slocing rows explicitly

df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826
2013-01-03  1.127938 -0.936733  0.489521  0.409856

In [29]:
# slicing columns explicitly

df.iloc[:, 1:3]

                   B         C
2013-01-01  1.442880  1.858224
2013-01-02  1.440314 -1.323161
2013-01-03 -0.936733  0.489521
2013-01-04  0.230341  2.110083
2013-01-05  0.648209  0.299254
2013-01-06 -0.014718 -1.093987

In [30]:
# getting value explicitly

df.iloc[1, 1]

1.4403142695316264

## Boolean Indexing

In [31]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  2.191036  1.442880  1.858224 -0.398214
2013-01-03  1.127938 -0.936733  0.489521  0.409856
2013-01-05  0.525189  0.648209  0.299254 -0.902637

In [32]:
df[df > 0]

                   A         B         C         D
2013-01-01  2.191036  1.442880  1.858224       NaN
2013-01-02       NaN  1.440314       NaN       NaN
2013-01-03  1.127938       NaN  0.489521  0.409856
2013-01-04       NaN  0.230341  2.110083  0.290532
2013-01-05  0.525189  0.648209  0.299254       NaN
2013-01-06       NaN       NaN       NaN       NaN

In [33]:
# isin method

df2 = df.copy()
df2["E"] = ["one", "one", "two", "three", "four", "three"]
df2

                   A         B         C         D      E
2013-01-01  2.191036  1.442880  1.858224 -0.398214    one
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826    one
2013-01-03  1.127938 -0.936733  0.489521  0.409856    two
2013-01-04 -1.117534  0.230341  2.110083  0.290532  three
2013-01-05  0.525189  0.648209  0.299254 -0.902637   four
2013-01-06 -1.096093 -0.014718 -1.093987 -0.396213  three

In [34]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  1.127938 -0.936733  0.489521  0.409856   two
2013-01-05  0.525189  0.648209  0.299254 -0.902637  four

In [35]:
# Setting

s1 = pd.Series([1, 2, 3, 4, 5, 6], index = pd.date_range("20130102", periods = 6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [36]:
df["F"] = s1

In [37]:
df

                   A         B         C         D    F
2013-01-01  2.191036  1.442880  1.858224 -0.398214  NaN
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826  1.0
2013-01-03  1.127938 -0.936733  0.489521  0.409856  2.0
2013-01-04 -1.117534  0.230341  2.110083  0.290532  3.0
2013-01-05  0.525189  0.648209  0.299254 -0.902637  4.0
2013-01-06 -1.096093 -0.014718 -1.093987 -0.396213  5.0

In [38]:
# Setting values by label
df.at[dates[0], "A"] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  1.442880  1.858224 -0.398214  NaN
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826  1.0
2013-01-03  1.127938 -0.936733  0.489521  0.409856  2.0
2013-01-04 -1.117534  0.230341  2.110083  0.290532  3.0
2013-01-05  0.525189  0.648209  0.299254 -0.902637  4.0
2013-01-06 -1.096093 -0.014718 -1.093987 -0.396213  5.0

In [39]:
# setting values by position
df.iat[0, 1] = 0
df

                   A         B         C         D    F
2013-01-01  0.000000  0.000000  1.858224 -0.398214  NaN
2013-01-02 -0.233592  1.440314 -1.323161 -0.863826  1.0
2013-01-03  1.127938 -0.936733  0.489521  0.409856  2.0
2013-01-04 -1.117534  0.230341  2.110083  0.290532  3.0
2013-01-05  0.525189  0.648209  0.299254 -0.902637  4.0
2013-01-06 -1.096093 -0.014718 -1.093987 -0.396213  5.0

In [40]:
# setting by assigning with a numpy array

df.loc[:, "D"] = np.array([5] * len(df))

In [41]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.858224  5  NaN
2013-01-02 -0.233592  1.440314 -1.323161  5  1.0
2013-01-03  1.127938 -0.936733  0.489521  5  2.0
2013-01-04 -1.117534  0.230341  2.110083  5  3.0
2013-01-05  0.525189  0.648209  0.299254  5  4.0
2013-01-06 -1.096093 -0.014718 -1.093987  5  5.0

In [42]:
# where operation

df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.858224 -5  NaN
2013-01-02 -0.233592 -1.440314 -1.323161 -5 -1.0
2013-01-03 -1.127938 -0.936733 -0.489521 -5 -2.0
2013-01-04 -1.117534 -0.230341 -2.110083 -5 -3.0
2013-01-05 -0.525189 -0.648209 -0.299254 -5 -4.0
2013-01-06 -1.096093 -0.014718 -1.093987 -5 -5.0

## Missing data

In [43]:
df1 = df.reindex(index = dates[0:4], columns = list(df.columns) + ["E"])
df1.loc[dates[0]:dates[1], "E"] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.858224  5  NaN  1.0
2013-01-02 -0.233592  1.440314 -1.323161  5  1.0  1.0
2013-01-03  1.127938 -0.936733  0.489521  5  2.0  NaN
2013-01-04 -1.117534  0.230341  2.110083  5  3.0  NaN

In [44]:
# drop missing data

df1.dropna(how = "any")

                   A         B         C  D    F    E
2013-01-02 -0.233592  1.440314 -1.323161  5  1.0  1.0

In [45]:
# filling missing data

df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.858224  5  5.0  1.0
2013-01-02 -0.233592  1.440314 -1.323161  5  1.0  1.0
2013-01-03  1.127938 -0.936733  0.489521  5  2.0  5.0
2013-01-04 -1.117534  0.230341  2.110083  5  3.0  5.0

In [46]:
# boolean mask

pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

## Operations

In [47]:
df.mean()

A   -0.132349
B    0.227902
C    0.389989
D    5.000000
F    3.000000
dtype: float64

In [48]:
df.mean(1)

2013-01-01    1.714556
2013-01-02    1.176712
2013-01-03    1.536145
2013-01-04    1.844578
2013-01-05    2.094530
2013-01-06    1.559040
Freq: D, dtype: float64

In [49]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index = dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [50]:
df.sub(s, axis = "index")

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03  0.127938 -1.936733 -0.510479  4.0  1.0
2013-01-04 -4.117534 -2.769659 -0.889917  2.0  0.0
2013-01-05 -4.474811 -4.351791 -4.700746  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

## Apply

In [51]:
# Apply functions

df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.858224   5   NaN
2013-01-02 -0.233592  1.440314  0.535063  10   1.0
2013-01-03  0.894346  0.503581  1.024583  15   3.0
2013-01-04 -0.223188  0.733922  3.134667  20   6.0
2013-01-05  0.302001  1.382131  3.433921  25  10.0
2013-01-06 -0.794092  1.367412  2.339934  30  15.0

In [52]:
df.apply(lambda x: x.max() - x.min())

A    2.245473
B    2.377048
C    3.433245
D    0.000000
F    4.000000
dtype: float64

In [53]:
df.apply(lambda x: x.max() - x.min(), axis = "index")

A    2.245473
B    2.377048
C    3.433245
D    0.000000
F    4.000000
dtype: float64

## Histogramming

In [54]:
s = pd.Series(np.random.randint(0, 7, size = 10))
s

0    5
1    1
2    5
3    5
4    1
5    4
6    3
7    0
8    1
9    1
dtype: int64

In [55]:
# counting values
s.value_counts()

1    4
5    3
4    1
3    1
0    1
dtype: int64

## String Methods

In [56]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge

In [57]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.601798 -1.259392  0.067606 -1.062316
1 -1.224819  0.105255 -0.475555  0.509497
2 -1.053791  0.087619  1.032266  0.618465
3  0.078958 -1.696125  0.060328 -0.231695
4  0.440649  2.569145  0.318497 -0.736852
5 -1.847198 -0.028544  1.726333  1.069557
6  0.779388 -1.496689 -1.226303  0.861271
7  0.777818  0.753598  0.148035 -1.333735
8  0.098976  0.728467  0.998676 -0.712757
9 -0.565511  1.685205  0.769659  0.644274

In [58]:
## break into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0  0.601798 -1.259392  0.067606 -1.062316
 1 -1.224819  0.105255 -0.475555  0.509497
 2 -1.053791  0.087619  1.032266  0.618465,
           0         1         2         3
 3  0.078958 -1.696125  0.060328 -0.231695
 4  0.440649  2.569145  0.318497 -0.736852
 5 -1.847198 -0.028544  1.726333  1.069557
 6  0.779388 -1.496689 -1.226303  0.861271,
           0         1         2         3
 7  0.777818  0.753598  0.148035 -1.333735
 8  0.098976  0.728467  0.998676 -0.712757
 9 -0.565511  1.685205  0.769659  0.644274]

In [59]:
# concat

pd.concat(pieces)

          0         1         2         3
0  0.601798 -1.259392  0.067606 -1.062316
1 -1.224819  0.105255 -0.475555  0.509497
2 -1.053791  0.087619  1.032266  0.618465
3  0.078958 -1.696125  0.060328 -0.231695
4  0.440649  2.569145  0.318497 -0.736852
5 -1.847198 -0.028544  1.726333  1.069557
6  0.779388 -1.496689 -1.226303  0.861271
7  0.777818  0.753598  0.148035 -1.333735
8  0.098976  0.728467  0.998676 -0.712757
9 -0.565511  1.685205  0.769659  0.644274

In [60]:
# Join

left  = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [61]:
left

   key  lval
0  foo     1
1  foo     2

In [62]:
right

   key  rval
0  foo     4
1  foo     5

In [63]:
pd.merge(left, right, on = "key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

## Append

In [64]:
df = pd.DataFrame(np.random.randn(8, 4), columns = ["A", "B", "C", "D"])
df

          A         B         C         D
0 -0.998342 -1.654365  0.532445  0.605931
1 -0.259772 -0.436428 -0.670800  1.967547
2  2.572042  0.823846  0.309939  0.531809
3  0.511115  1.351998  0.422102 -1.160602
4  3.026335  0.270864 -0.809805  0.821794
5 -0.541246 -0.489527  0.993364 -0.734277
6 -0.214425  0.930187  0.279632  0.867730
7  0.930900  0.139811 -0.230853  0.432910

In [65]:
s = df.iloc[3]
s

A    0.511115
B    1.351998
C    0.422102
D   -1.160602
Name: 3, dtype: float64

In [66]:
df.append(s, ignore_index = True)

          A         B         C         D
0 -0.998342 -1.654365  0.532445  0.605931
1 -0.259772 -0.436428 -0.670800  1.967547
2  2.572042  0.823846  0.309939  0.531809
3  0.511115  1.351998  0.422102 -1.160602
4  3.026335  0.270864 -0.809805  0.821794
5 -0.541246 -0.489527  0.993364 -0.734277
6 -0.214425  0.930187  0.279632  0.867730
7  0.930900  0.139811 -0.230853  0.432910
8  0.511115  1.351998  0.422102 -1.160602